[
  {
    "id": 1,
    "name": "Entrance Hall",
    "description": "A large room with a portrait on the wall",
    "long_description": "You are standing in the entrance hall of a small cabin. There is a portrait on the wall which depicts a noble looking elderly man. The grim expression on his face spells trouble. There are doors to the north and east. A staircase leads to the upper floor. The entrance to the cabin is to the south, but you have no reason to leave.",
    "neighbors": {
      "upstairs": 5,
      "north": 2,
      "east": 3
    }
  },
  {
    "id": 2,
    "name": "Sitting Room",
    "description": "A room with comfortable chairs around a fireplace",
    "long_description": "Comfortable-looking chairs rest facing a fireplace in this sitting room. A large window looks out onto the forest behind the cabin. There are doors to the south and east.",
    "neighbors": {
      "south": 1,
      "east": 4
    }
  },
  {
    "id": 3,
    "name": "Kitchen",
    "description": "A room with a large stove and pots and pans",
    "long_description": "The center of this kitchen features a large wood-burning stove, pots and pans hang securely above it. Counter tops and cabinets line the walls, and a pantry can be seen to one side. There are doors to the west and north.",
    "neighbors": {
      "west": 1,
      "north": 4
    },
    "items": [
      2
    ]
  },
  {
    "id": 4,
    "name": "Dining Room",
    "description": "A room with a long table and chairs",
    "long_description": "A long oak table stretches across the middle of this dining room. sturdy-looking chairs line its sides with an larger ornate chair at the far head. There are doors to the south and west.",
    "neighbors": {
      "west": 2,
      "south": 3
    }
  },
  {
    "id": 5,
    "name": "Upstairs Hallway",
    "description": "A cramped hallway with a chest on the far end",
    "long_description": "This hallway is rather dark, with a single window at the far end. A chest sits against the wall underneath it, and there are doors to the east and west. A staircase leads down to the entrance hall.",
    "neighbors": {
      "downstairs": 1,
      "east": 6,
      "west": 7
    },
    "items": [
      4
    ]
  },
  {
    "id": 6,
    "name": "Study",
    "description": "A room with a large desk and leather armchair",
    "long_description": "The study is a quiet retreat, dominated by a large oak desk piled high with papers and books. A leather armchair sits nearby, its well-worn cushions inviting you to sit and contemplate. A small bookshelf appears to contain some personal journals. A door to the west leads back to the hallway.",
    "neighbors": {
      "west": 5
    }
  },
  {
    "id": 7,
    "name": "Bedroom",
    "description": "A cozy room with a large bed",
    "long_description": "A small bed sits squarely against the far wall of this bedroom. A nightstand sits beside it, and a wardrobe stands against the wall. A door to the east leads back to the hallway.",
    "neighbors": {
      "east": 5
    }
  },
  {
    "id": 8,
    "name": "Library",
    "description": "A cozy library with chairs and lots of books",
    "long_description": "The library is a cozy room with several comfortable chairs. Bookshelves line the walls, filled with volumes on a variety of subjects. A door to the south leads back to the sitting room.",
    "neighbors": {
      "south": 2
    },
    "items": [
      1
    ]
  }
]